# -*- coding: utf-8 -*-
def version():
    # 1.0.7更新内容:
    # 1.添加一键删除功能,可以删除项目下的所有用例,方便在上传错误用例后进行处理;
    # 2.添加跳转禅道功能,可以跳转到禅道对应项目的用例页面;
    # 3.优化了异常捕获日志输出的质量;
    # 4.优化了部分sql语句,减少了部分慢查询;
    # version="1.0.7"

    # 1.0.8更新内容:
    # 1.解决了多项目多产品之间的互相关联产生的一系列bug;
    # 2.解决了项目里无法生成测试单的bug;
    # version = "1.0.8"

    # 1.0.9更新内容:
    # 1.添加功能上传用例到项目时可带入公共用例库用例，该功能由勾选框控件控制，默认勾选;
    # 2.增加包含二级用例库时，仍可选为空的功能;
    # 3.优化部分sql;
    # 4.增加功能用例库上传表格可上传用例个数为0时，自动关闭页面;
    # version = "1.0.9"

    # 1.1.0更新内容：
    # 1.添加功能可查看各人最近四年Q1-Q4的所建立任务总数;
    # 2.添加功能可查看各人最近四年Q1-Q4的所建立BUG总数;
    # 3.下线用例模板功能;
    # 4.调整部分功能权限;
    # 5.配备可快捷修改密码功能，需要账号权限;
    version = "1.1.0"

    return version

